HR_R1/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

14
(
    wall_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       462;
    }
    wall_top
    {
        type            patch;
        nFaces          1;
        startFace       463;
    }
    front1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          165;
        startFace       464;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back1;
    }
    back1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          165;
        startFace       629;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front1;
    }
    left1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          165;
        startFace       794;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right1;
    }
    right1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          165;
        startFace       959;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left1;
    }
    front2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          133;
        startFace       1124;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back2;
    }
    back2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          133;
        startFace       1257;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front2;
    }
    left2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          133;
        startFace       1390;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right2;
    }
    right2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          133;
        startFace       1523;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left2;
    }
    front3
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          165;
        startFace       1656;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back3;
    }
    back3
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          165;
        startFace       1821;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front3;
    }
    left3
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          165;
        startFace       1986;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right3;
    }
    right3
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          165;
        startFace       2151;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left3;
    }
)

// ************************************************************************* //
